from tools.tool import *

# 把每一种攻击能够使用的工具列出来，后续会推出基于向量库的攻击调用方法
tools = {
    "普通木马攻击": [check_files, check_kworker, check_2599, check_behavior, get_assests],
    "webshell攻击": [],
    "web漏洞攻击": [],
    "反序列化攻击": [],
    "缓冲区溢出攻击": [],
    "拒绝服务攻击": [],
    "跨站脚本攻击": [],
    "目录遍历攻击": [],
    "扫描探测": [],
    "数据破坏": [],
    "数据泄露": [],
    "通用网络攻击": [],
    "未授权访问攻击": [],
    "文件上传攻击": [],
    "信息窃取": [],
    "业务安全": [],
    "异常流量": [],
    "鱼叉攻击": [],
    "远程代码命令执行": [],
    "远程文件包含攻击": [],
    "账号暴力破解": [],
    "账号弱口令": [],
    "注入型攻击": [],
}

